using System;   // Подключаемое пространство имен        

/// <summary>
/// Пространство имен проекта
/// </summary>
namespace HelloApp 
{
    // Начало блока пространства имен

    // Объявляем новый класс.
    class Program 
    {
        // Начало блока класса

        // Объявление нового метода
        static void Main(string[] arg) 
        {
            // Начало блока метода

            // Конец блока метода

        }

        // Конец блока класса

    }

    // Конец блока пространства имен
}